# Referenties

Altijd beginnen met 'getting started':

https://pandas.pydata.org/docs/getting_started/index.html#getting-started

Dan een snel overzicht:

https://pandas.pydata.org/docs/user_guide/10min.html

Daarna kijken naar de API beschrijving:

https://pandas.pydata.org/docs/reference/index.html

# Installatie

Run `pip3 install pandas` in the terminal to install the Pandas library.

# Imports

In [8]:
import pandas as pd

import matplotlib.pyplot as plt

<p> column = series

# Schetsen

In [9]:
# Dataframe maken
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [
            22,
            35,
            58
        ],
        "Sex": [
            "male",
            "male",
            "female"
        ],
    }
)

# Standaard print
print(df)
# ...

# Vergelijk met
df
# ...

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [10]:
# Data opslaan
df.to_csv('output/opdr.csv', index=False)
df.to_csv('output/opdr2.csv')
# ...

In [11]:
# Data inlezen
persons2 = pd.read_csv('output/opdr.csv')
persons2
persons = pd.read_csv('output/opdr2.csv')
# ...

In [12]:
# Een kolom verwijderen
persons.pop("Unnamed: 0")
persons
# ...

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [13]:
# De kolomnaam
persons.columns[0] #with indez
# ...

'Name'

In [14]:
# Een kolom lezen
persons["Age"] # with name of the column

# ...

0    22
1    35
2    58
Name: Age, dtype: int64

In [15]:
# Een rij lezen
persons.loc[0:0]
# ...

                      Name  Age   Sex
0  Braund, Mr. Owen Harris   22  male

In [16]:
# Functie getRow() maken

def getRowf(df, index1, index2):
    return df.loc[index1:index2]


# ...


# Testen
row = getRowf(persons, 0,2)

# print
print(row)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [17]:
# Een rij toevoegen
adding = df.loc[3] = ["Amad", 37,"male"]
df
# ...

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female
3                      Amad   37    male

In [18]:
# Functie insertAt(row, index)
def insertAt(df, row, index):
    
    df.loc[index + .5] = row
    
    # Reindex
    return df.sort_index().reset_index(drop=True)

# Testen
persons = insertAt(persons, ["Kevin", 40, "male"], 1)

persons
# ...

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2                     Kevin   40    male
3  Bonnell, Miss. Elizabeth   58  female

In [19]:
# Verkennen
rows = persons.head()
getRow(rows, 1)
# ...

NameError: name 'getRow' is not defined

In [35]:
# Filteren
# persons[persons["Sex"] == "male"]
ftl = (persons["Age"] > 40) & (persons["Sex"] == "female")
persons[ftl]
# ...

                       Name  Age     Sex
3  Bonnell, Miss. Elizabeth   58  female

In [37]:
# Groeperen
persons.groupby("Sex", group_keys=True).apply(lambda x: x)
# ...

                              Name  Age     Sex
Sex
female 3  Bonnell, Miss. Elizabeth   58  female
male   0   Braund, Mr. Owen Harris   22    male
       1  Allen, Mr. William Henry   35    male
       2                     Kevin   40    male

In [40]:
# Extra: toepassing OOP en het bouwen van je eigen library

# ...
# Extra: toepassing OOP en het bouwen van je eigen library
class MyDataFrame:
    
    # Here we assume that df is of type pd.DataFrame
    def __init__(self, df):
        
        self.df = df


    def getRow(self, index):

        return self.df.loc[index:index]


    def insertAt(self, row, index):
    
        self.df.loc[index - .5] = row

        # Reindex
        self =  self.sort_index().reset_index(drop=True)


    # This builtin enables the [] operator
    def __getitem__(self, key):
        
        return self.df[key]


    # This builtin enables us to print the dataframe
    def __str__(self):
        
        self.df 


        
# Testen
copy = MyDataFrame(persons)

copy["Name"]
copy.getRow(2)
# Testen

# ...

    Name  Age   Sex
2  Kevin   40  male